import { db } from '~/server/db';
import * as console from 'console';

import { updatePermissions } from '~/utils/updatePermissions';
import { createCaller } from '~/server/api/root';
import { logWithDivider } from '~/utils';

const USERS = [
    {
        email: 'kdenis0610@gmail.com',
        password: 'pa$$worD',
        description: 'Admin user',
        name: 'Denys',
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/default_avatar.png',
        notes: 'A complicated case',
    },
    {
        email: 'zipzk211_cham@student.ztu.edu.ua',
        password: 'pa$$worD',
        description: 'Admin user',
        name: 'Anton-Cherniuk',
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/default_avatar.png',
        notes: 'A complicated case',
    },
];

const POSTS = [
    {
        title: "Важливість самоспівчуття у покращенні ментального здоров'я",
        description:
            "<p>У сучасному світі, де прагнення до успіху і досконалості часто ставлять під загрозу наше ментальне здоров'я, важливо навчитися не тільки приймати, але й піклуватися про себе. Самоспівчуття є однією з ключових концепцій в психології, яка може допомогти людям краще впоратися зі стресом, підвищити стійкість і сприяти загальному психологічному благополуччю.</p><p><br></p><h2>Що таке самоспівчуття?</h2><p>Самоспівчуття — це спосіб ставлення до себе, який передбачає доброзичливість, розуміння та прийняття своїх недоліків і помилок. Замість того, щоб критикувати себе за невдачі або відчувати внутрішній сором, людина, яка практикує самоспівчуття, ставиться до себе так само, як ставилася б до доброго друга в аналогічній ситуації.</p><h4>Чому самоспівчуття є важливим?</h4><ol><li><strong>Зниження рівня стресу:</strong> Самоспівчуття допомагає пом'якшити стрес, оскільки практика прийняття та доброзичливості до себе розряджає емоційну напругу і сприяє релаксації.</li><li><strong>Підвищення стійкості:</strong> Люди, які практикують самоспівчуття, легше адаптуються до негативних життєвих подій і менш схильні до депресії і анксіозності.</li><li><strong>Покращення відносин:</strong> Самоспівчуття може покращити особисті відносини, знижуючи агресію і підвищуючи емпатію та підтримку між партнерами.</li></ol><h4>Як розвивати самоспівчуття?</h4><ol><li><strong>Самосвідомість:</strong> Спробуйте вести щоденник, щоб краще розуміти власні емоції та реакції.</li><li><strong>Медитація та міндфулнес:</strong> Практикуйте усвідомленість, медитацію на прийняття та доброзичливість до себе, щоб культивувати більш спокійне та приязне ставлення до власних переживань.</li><li><strong>Самопідтримка:</strong> Навчіться розпізнавати і відмовлятися від самокритики. Замініть її підтримкою та мотивуючими афірмаціями.</li></ol><h4><br></h4><p>Розвиток самоспівчуття може стати однією з найбільш цінних інвестицій у ваше ментальне здоров'я. Це не тільки зменшить емоційний біль у труднощах, але й збільшить вашу здатність радіти життю. Починайте маленькими кроками і не забувайте, що самоспівчуття — це подорож, а не миттєва мета.</p>",
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/2044a9c3-ea43-4716-8746-e17446b641ee.png',
        published: true,
    },
    {
        title: 'Стратегії подолання тривоги: знаходимо спокій у неспокійному світі',
        description:
            '<p>У нашому швидкоплинному світі тривога стала майже загальним явищем. Часто вважають, що тривога — це лише тимчасове відчуття нервозності або занепокоєння, але для багатьох людей це стан, який може істотно вплинути на якість їхнього життя. Важливо розуміти, що тривога — це не просто стан душі, це складний взаємозв\'язок між фізіологією, думками та зовнішнім середовищем. Розглянемо декілька стратегій, які можуть допомогти людям краще управляти своєю тривогою.</p><h2>1. Майндфулнес і медитація</h2><p>Міндфулнес — це практика, яка вчить нас бути більш усвідомленими в моменті "тут і зараз". Регулярна медитація може знизити рівень стресу та анксіозності, а також покращити концентрацію та загальне емоційне самопочуття. Вчення зосереджуватися на своєму диханні та спостерігати за своїми думками без оцінювання може зменшити вплив тривожних думок.</p><h2>2. Фізичні вправи</h2><p>Регулярні фізичні вправи є однією з найефективніших стратегій для зменшення симптомів тривоги. Фізична активність стимулює вироблення ендорфінів, природних заспокійливих речовин мозку. Навіть короткочасні фізичні навантаження, такі як ходьба або йога, можуть значно покращити настрій.</p><h2>3. Корекція харчування</h2><p>Харчування також впливає на наш ментальний стан. Збалансована дієта, багата на омега-3 жирні кислоти, комплексні вуглеводи, білки, фрукти і овочі, може допомогти стабілізувати рівні цукру в крові та зменшити симптоми тривоги.</p><h2>4. Достатній сон</h2><p>Недолік сну може посилити симптоми тривоги. Стратегії, які можуть допомогти покращити якість сну, включають встановлення регулярного розкладу сну, уникання екранів перед сном, та створення комфортного, тихого сонного середовища.</p><h2>5. Терапія та підтримка</h2><p>Розмова з психотерапевтом може надати інструменти для кращого управління тривогою. Когнітивно-поведінкова терапія (КПТ) та інші форми психотерапії довели свою ефективність у лікуванні тривожних розладів. Також корисною може бути підтримка друзів або груп підтримки, де можна поділитися своїми переживаннями.</p><p>Важливо пам\'ятати, що кожна людина унікальна, і те, що працює для однієї, може не працювати для іншої. Знаходження власного шляху управління тривогою — це процес, що може потребувати часу та терпіння, але з правильними інструментами і підтримкою, можна знайти баланс і спокій.</p>',
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/d5f30256-86fb-4907-a4bd-e62aea9eeb50.png',
        published: true,
    },
    {
        title: "Освоєння стресу через мистецтво усвідомленості: Практичні поради для покращення ментального здоров'я",
        description:
            '<p>У нашому сучасному світі стрес став постійною реальністю для багатьох з нас, затуляючи наші дні турботами та напругою. Завдяки розробці різноманітних психологічних практик, зараз ми маємо можливість не просто боротися зі стресом, а й перетворювати його в енергію для особистісного росту. Одним із найефективніших інструментів в цьому процесі є мистецтво усвідомленості (майндфулнес).</p><h4>Що таке усвідомленість?</h4><p>Усвідомленість — це практика зосередження своєї уваги на теперішньому моменті, приймаючи свої думки, почуття та відчуття без критики чи суджень. Ця техніка заснована на буддійських медитативних практиках, але не вимагає релігійної прив’язки і може бути застосована будь-ким.</p><h4>Як усвідомленість допомагає боротися зі стресом?</h4><ol><li><strong>Підвищення усвідомленості.</strong> Практикування усвідомленості дозволяє краще розуміти свої внутрішні процеси. Завдяки цьому можна виявляти стрес на ранніх стадіях і управляти його впливом на організм.</li><li><strong>Зменшення автоматичної реакції на стрес.</strong> Майндфулнес допомагає перервати "автопілот" реакцій, які часто призводять до стресу. Замість того, щоб інстинктивно реагувати на стресові події, ви навчитеся спостерігати за своїми реакціями і вибирати більш здорові способи відповіді.</li><li><strong>Покращення регуляції емоцій.</strong> Регулярна практика майндфулнес допомагає краще контролювати свої емоції, що є ключовим у зменшенні відчуття стресу.</li></ol><h4>Практичні поради для впровадження усвідомленості у ваше життя</h4><ol><li><strong>Щоденна медитація.</strong> Почніть із 5-10 хвилин щоденної медитації, поступово збільшуючи час. Використовуйте додатки для медитації або онлайн-ресурси, щоб отримати керівництво.</li><li><strong>Дихальні техніки.</strong> Прості дихальні вправи можуть бути дуже ефективними в моменти високого стресу. Візьміть глибокий вдих, утримуйте дихання на кілька секунд, потім видихніть повільно. Повторіть кілька разів.</li><li><strong>Щоденник усвідомленості.</strong> Записуйте свої щоденні досвіди з майндфулнесом, включаючи ваші почуття, думки, емоції. Це допоможе вам зрозуміти, як усвідомленість впливає на ваше життя і як ви реагуєте на стрес.</li><li><strong>Інтеграція усвідомленості в повсякденні дії.</strong> Намагайтесь застосовувати майндфулнес під час звичайної діяльності, наприклад, під час ходьби, їжі чи ведення розмови. Ваша мета — бути повністю присутнім у теперішньому моменті.</li></ol><p>Впровадження усвідомленості у ваше життя може стати міцним фундаментом для покращення ментального здоров’я і загального благополуччя. Ця практика не лише допоможе вам краще справлятися зі стресом, але й підвищить вашу здатність цінувати життя тут і зараз.</p>',
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/2fa76148-8ab5-47e6-b995-02c794d25ec9.png',
        published: true,
    },
    {
        title: "Значення майндфулнес для покращення ментального здоров'я",
        description:
            "<p>Міндфулнес, або уважність, є потужним інструментом у сфері психології, спрямованим на підтримку та покращення ментального здоров'я. В останні роки він набув особливої популярності завдяки своїй здатності допомагати людям краще управляти стресом, знижувати рівень тривоги та покращувати загальне емоційне благополуччя. У цій статті ми розглянемо, як саме міндфулнес може бути корисним у вашому повсякденному житті.</p><h4>Що таке міндфулнес?</h4><p>Міндфулнес — це практика, що включає уважне спостереження за власними думками, емоціями і відчуттями в моменті \"тут і зараз\", без оцінювання або критики. Ця практика базується на буддійських медитативних традиціях, але її можна адаптувати та застосовувати незалежно від релігійних переконань.</p><h4>Користь міндфулнесу для ментального здоров'я</h4><ol><li><strong>Зниження стресу</strong>: Регулярна практика міндфулнесу допомагає розслабитися та відпустити напруження, що в свою чергу знижує рівень стресу.</li><li><strong>Поліпшення концентрації</strong>: Міндфулнес зосереджує увагу на поточному моменті, що може значно покращити вашу концентрацію і ясність думок.</li><li><strong>Емоційна резилиентність</strong>: Уважність допомагає краще розуміти та приймати свої емоції, не дозволяючи їм взяти верх над раціональним мисленням.</li><li><strong>Підвищення самосвідомості</strong>: Міндфулнес вчить вас більше уваги приділяти власним думкам та почуттям, що сприяє глибшому розумінню себе.</li></ol><h4>Як почати практикувати міндфулнес?</h4><p>Початок практики міндфулнесу не вимагає значних інвестицій чи особливих навичок, достатньо лише декілька хвилин щоденно:</p><ol><li><strong>Медитація</strong>: Почніть з короткої медитації в 5-10 хвилин щодня, зосереджуючись на своєму диханні.</li><li><strong>Свідоме сприйняття</strong>: Спробуйте свідомо сприймати рутинні дії, наприклад, їжу або прогулянку. Зосередьте увагу на смаках, звуках, відчуттях.</li><li><strong>Уважні вправи</strong>: Виконуйте прості вправи, такі як свідоме дихання або уважне слухання музики, звертаючи увагу на кожен аспект вашого досвіду.</li></ol><h4>Висновок</h4><p>Міндфулнес може стати важливим елементом вашого життя, що допоможе покращити ментальне здоров'я та загальне благополуччя. Пам'ятайте, що, як і будь-яка інша навичка, уважність вимагає регулярної практики та терпіння. З часом ви зможете помітити позитивні зміни в своєму емоційному стані та способі мислення.</p>",
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/b101ddad-5428-4357-ab61-3bfaa29ec473.png',
        published: true,
    },
    {
        title: "Важливість емоційної присутності для ментального здоров'я",
        description:
            "<p>У сучасному світі, де стрес і тривога часто стають нашими постійними супутниками, важливо навчитися залишатися емоційно присутнім. Емоційна присутність — це не тільки спосість керувати своїми почуттями, але й здатність відчувати і розуміти емоції інших. Вона відіграє ключову роль в побудові стійкості та підтримці ментального здоров'я, забезпечуючи кращу адаптацію до життєвих викликів та підвищуючи загальне відчуття задоволеності життям.</p><h2>Що таке емоційна присутність?</h2><p>Емоційна присутність може бути визначена як свідомість і прийняття своїх власних емоцій та почуттів інших без негайного реагування або судження. Це включає в себе уміння зупинитися, спостерігати за своїми емоціями та реакціями і тільки потім вибирати, як діяти, замість того, щоб керуватися автоматичними відповідями.</p><h2>Як розвивати емоційну присутність?</h2><h3>Медитація</h3><p>Одним із способів розвитку емоційної присутності є медитація. Практика уважності допомагає знизити рівень стресу, покращити концентрацію та підвищити сприйняття емоцій. Вона навчає нас бути свідомими моменту \"тут і зараз\", визнавати емоції без оцінювання та критики.</p><h3>Емоційний щоденник</h3><p>Ще один інструмент — ведення емоційного щоденника, де ви можете записувати свої думки та почуття. Це допоможе вам краще розуміти, які події або обставини провокують певні емоції, і розробити стратегії для їх керування.</p><h3>Комунікація</h3><p>Покращення комунікативних навичок також сприяє розвитку емоційної присутності. Вчіться висловлювати свої почуття чітко і відкрито, не боячись обговорювати емоційно складні теми.</p><h2>Переваги емоційної присутності</h2><h3>Покращення відносин</h3><p>Емоційна присутність може значно покращити особистісні відносини, допомагаючи краще розуміти та відчувати потреби інших. Це сприяє глибшому і більш інтимному зв'язку між людьми.</p><h3>Зниження стресу</h3><p>Здатність керувати емоціями сприяє зниженню рівня стресу та тривожності. Ви навчаєтеся не реагувати на кожну стресову ситуацію автоматично, а спокійно і раціонально шукати виходи із складних обставин.</p><h3>Підвищення самооцінки</h3><p>Емоційна присутність допомагає людям почуватися більш контрольованими та впевненими у собі, підвищуючи їхнє самоповагу та внутрішню гармонію.</p><h2>Заключення</h2><p>Емоційна присутність не просто навичка, це спосіб життя, який може корінним чином змінити ваше ставлення до себе і оточуючих. Інтегруючи ці практики в своє повсякденне життя, ви зможете не тільки покращити своє ментальне здоров'я, але й відчути більше радості та задоволення від життя. Варто почати цей шлях з маленьких кроків, і ви помітите, як ваш світогляд та відносини з іншими почнуть трансформуватися на краще.</p>",
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/1a0ecad0-5ae6-4b60-97bb-33857b294137.png',
        published: true,
    },
    {
        title: 'Як встановлення меж може покращити ваше ментальне здоров’я',
        description:
            '<p>Межі — це основні інструменти в психології, які допомагають нам визначити, де закінчуємося ми і починається хтось інший. Встановлення ефективних меж є життєво необхідним для підтримки здорових відносин та особистого благополуччя. У цій статті ми розглянемо, як чітке визначення та підтримка ваших меж можуть значно покращити ваше ментальне здоров’я.</p><h4>1. Значення меж у психології</h4><p>Межі можна класифікувати за декількома категоріями: емоційні, фізичні, інтелектуальні та часові. Емоційні межі визначають, як ви дозволяєте іншим впливати на ваші емоції. Фізичні межі стосуються вашого особистого простору та фізичного дотику. Інтелектуальні межі захищають ваші думки та переконання, а часові межі допомагають вам керувати вашим часом.</p><h4>2. Переваги встановлення меж</h4><p><strong>Зменшення стресу:</strong> Коли люди чітко розуміють ваши очікування, це може зменшити кількість непорозумінь та стресу у ваших відносинах.</p><p><strong>Покращення самоповаги:</strong> Встановлення меж є актом самоповаги. Ви активно вирішуєте, що вам комфортно, а що ні, і це може значно покращити вашу впевненість у собі.</p><p><strong>Кращі відносини:</strong> Чіткі межі допомагають уникнути емоційного вигоряння, оскільки ви контролюєте своє взаємодіяння з іншими. Це створює більш здорові та взаємовигідні відносини.</p><h4>3. Як встановити межі</h4><p><strong>Самоаналіз:</strong> Почніть із визначення аспектів свого життя, де вам можуть знадобитися більш чіткі межі. Це може бути пов’язано з вашим часом, простором, емоціями або взаємодіями.</p><p><strong>Комунікація:</strong> Чітко і твердо комунікуйте свої межі іншим. Використовуйте "Я" -повідомлення, щоб висловити свої потреби та почуття, наприклад: "Я відчуваю, що мені потрібно більше часу на себе".</p><p><strong>Дотримання меж:</strong> Після встановлення меж дотримуйтесь їх. Якщо інші спробують їх порушити, чітко та рішуче нагадуйте про ваші кордони.</p><p><strong>Регулярна переоцінка:</strong> Ваші потреби можуть змінюватись, тому регулярно переоцінюйте та коригуйте свої межі залежно від обставин.</p><h4>4. Висновок</h4><p>Встановлення та підтримка меж є критично важливими для ментального здоров’я. Вони дозволяють захистити ваші емоції, зберегти енергію та підтримати здорові відносини. Пам\'ятайте, що ваше право встановлювати межі є невід’ємною частиною догляду за собою. Слідкуючи за цими принципами, ви зможете краще контролювати своє життя та покращити своє ментальне здоров\'я.</p>',
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/b659bfa8-789b-472c-8601-e5a97be4d2e9.png',
        published: true,
    },
    {
        title: "Стратегії самопідтримки для боротьби з тривогою: Практичні поради для покращення вашого ментального здоров'я",
        description:
            "<p>У сучасному світі, де стрес став невід'ємною частиною повсякденного життя, важливо розробляти та практикувати стратегії самопідтримки, щоб зменшити тривогу та покращити загальне ментальне здоров'я. Впровадження простих, але ефективних методів може допомогти зміцнити вашу здатність адаптуватися до стресових ситуацій та підтримувати стійкість у складних умовах.</p><p><br></p><p><strong>1. Визначення тривоги та її вплив</strong> Тривога — це не просто почуття нервовості або занепокоєння. Це складний емоційний стан, який може включати фізіологічні реакції, такі як збільшення серцебиття, підвищення артеріального тиску та зниження концентрації уваги. Постійні тривожні стани можуть призводити до серйозних ментальних розладів, таких як генералізований тривожний розлад, панічні атаки або соціальна анксіозність.</p><p><strong>2. Техніки релаксації</strong> Однією з ефективних стратегій боротьби з тривогою є використання технік релаксації. Глибоке дихання, медитація, йога чи прогулянки на свіжому повітрі можуть допомогти заспокоїти розум і тіло. Такі практики дозволяють знизити рівень кортизолу, гормону стресу, і стимулювати вироблення ендорфінів, які покращують настрій.</p><p><strong>3. Ведення щоденника</strong> Щоденник може стати потужним інструментом для виявлення тригерів тривоги та управління вашими емоційними реакціями. Записуючи свої думки та почуття, ви можете краще зрозуміти, що провокує ваші тривожні реакції і як ви зазвичай реагуєте на них. Це знання може стати ключем до розробки ефективніших стратегій справляння зі стресом.</p><p><strong>4. Створення підтримувальної мережі</strong> Не варто недооцінювати важливість соціальної підтримки. Спілкування з друзями, родиною або навіть участь у групах підтримки може забезпечити необхідну емоційну розрядку та допомогти вам відчувати себе менш ізольованим у своїх переживаннях. Часто просто висловити свої думки вголос може значно зменшити їхню тривожну вагу.</p><p><strong>5. Практика позитивного самоставлення</strong> Розвиваючи позитивний діалог із собою, ви можете значно покращити своє ставлення до себе та до життя в цілому. Замінюйте негативні думки позитивними афірмаціями, які підтримують і мотивують вас. Пам'ятайте, що ви контролюєте свої думки, і ви можете обрати зосередитися на позитивних.</p><p><br></p><p>Управління тривогою — це не одноразовий акт, але постійна практика. Використовуючи ці стратегії, ви не лише зможете зменшити поточний рівень тривожності, але й покращити загальну якість вашого життя. Пам'ятайте, що допомога професіонала також може бути важливою частиною вашого процесу відновлення та самопідтримки.</p>",
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/ea6bbfeb-66df-438b-a686-f9ed6b0682ca.png',
        published: true,
    },
    {
        title: "Психологічна гнучкість: ключ до покращення ментального здоров'я",
        description:
            "<p>У сучасному світі, який постійно змінюється, важливість психологічної гнучкості не може бути переоцінена. Психологічна гнучкість — це здатність адаптуватися до обставин, змінювати поведінку і відносини в залежності від ситуації, при цьому залишаючись вірними своїм цінностям і цілям. Вона не тільки допомагає нам краще справлятися зі стресом, але й підтримує загальне ментальне здоров'я. У цій статті ми розглянемо, як розвивати психологічну гнучкість і чому вона має таке велике значення.</p><p><br></p><p><strong>Що таке психологічна гнучкість?</strong></p><p>Психологічна гнучкість означає здатність відчувати і приймати свої думки та емоції без уникнення і самообману, змінювати або утримуватися від дій, які відповідають важливим для особистості цінностям. Вона включає в себе три основні компоненти:</p><ol><li><strong>Відкритість до досвіду:</strong> Здатність приймати власні думки і почуття, незалежно від того, як вони неприємні чи болісні.</li><li><strong>Центрованість у контексті:</strong> Орієнтація на теперішній момент і свідоме сприйняття ситуації без автоматичних реакцій.</li><li><strong>Здатність до дій:</strong> Вибір поведінки, яка найкращим чином відповідає особистим цінностям і довгостроковим цілям, незважаючи на внутрішні труднощі.</li></ol><p><strong>Чому психологічна гнучкість важлива?</strong></p><p>Дослідження показують, що психологічна гнучкість може знижувати рівень стресу, тривожності та депресії. Вона допомагає людям адаптуватися до змін і викликів, поліпшуючи тим самим загальне ментальне здоров'я і добробут. Люди з вищим рівнем психологічної гнучкості краще справляються з негараздами і ефективно досягають своїх цілей.</p><p><strong>Як розвинути психологічну гнучкість?</strong></p><ol><li><strong>Практика усвідомленості:</strong> Регулярні медитації та практики усвідомленості допомагають зосередитися на теперішньому моменті і відчути свої думки і емоції без оцінки.</li><li><strong>Визначення та утвердження цінностей:</strong> Важливо чітко визначити, що є значущим в вашому житті, і робити свідомий вибір на користь дій, які відповідають цим цінностям.</li><li><strong>Гнучке переосмислення ситуацій:</strong> Навчіться бачити проблеми під різними кутами, замість того, щоб реагувати на них автоматично.</li></ol><p><br></p><p>Розвиток психологічної гнучкості є довготривалим процесом, який вимагає практики та відданості. Проте, зусилля, вкладені в цей процес, окупаються підвищенням загального ментального здоров'я і добробуту. Впровадження вищезгаданих стратегій може допомогти вам стати більш психологічно гнучким і, в кінцевому підсумку, щасливішим у своєму житті.</p>",
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/ac547239-cfbe-4d6e-8380-f35ad0125d82.png',
        published: true,
    },
    {
        title: "Психологічна стійкість: Шлях до кращого ментального здоров'я",
        description:
            "<p>У сучасному світі, де стрес та тривога стали повсякденністю, психологічна стійкість виступає ключовим аспектом у підтримці ментального здоров'я. Психологічна стійкість — це не просто здатність витримувати життєві випробування, але й спосіб адаптації та відновлення після них. Ця стаття розгляне, що таке психологічна стійкість, чому вона важлива, і як кожен може розвивати ці навички в повсякденному житті.</p><h4>Що таке психологічна стійкість?</h4><p>Психологічна стійкість описується як процес і результат адаптації до труднощів, конфліктів, змін та тиску. Це не іннатна якість, що ви отримуєте з народженням; це набір навичок, які можна розвинути та зміцнити протягом життя.</p><h4>Чому психологічна стійкість є важливою?</h4><ol><li><strong>Краще управління стресом:</strong> Стійкі люди здатні ефективніше справлятися зі стресом, знаходячи конструктивні шляхи його переживання та зниження.</li><li><strong>Відновлення після труднощів:</strong> Вміння підніматися після падінь і продовжувати рух вперед є критично важливим для психічного здоров'я.</li><li><strong>Покращене прийняття рішень:</strong> У стані стресу стійкі особистості здатні залишатися спокійними та робити обдумані рішення.</li></ol><h4>Як розвивати психологічну стійкість?</h4><p><strong>1. Підтримка мережі:</strong> Створення та підтримання міцних соціальних зв'язків може забезпечити необхідну підтримку та почуття приналежності. Спілкування з друзями, родиною та колегами може допомогти вам пережити важкі часи.</p><p><strong>2. Позитивне мислення:</strong> Зосередження на позитивних аспектах та вдячності може зміцнити стійкість. Практикуйте щоденне ведення журналу вдячності або рефлексії, щоб підтримувати позитивний настрій.</p><p><strong>3. Самодопомога та самооцінка:</strong> Регулярна самооцінка та прийняття власних емоцій та думок можуть покращити ваше розуміння власних потреб. Вивчайте техніки релаксації, медитації та відновлення.</p><p><strong>4. Цілепокладання:</strong> Встановлення реалістичних цілей та розробка кроків до їх досягнення може дати вам почуття контролю та напрямку.</p><p><strong>5. Підтримка адаптивності:</strong> Будьте готові адаптуватися до змін і викликів. Гнучке ставлення до змін і невизначеності може значно підвищити вашу здатність до стійкості.</p><h4><br></h4><p>Психологічна стійкість не є чимось недосяжним. Вона складається з навичок, які кожен може розвивати для підвищення свого ментального здоров'я та благополуччя. Закладаючи основу для розвитку стійкості, ми не тільки краще справляємося з випробуваннями, але й відкриваємо можливості для зростання та самовдосконалення. Нехай ваша подорож до стійкості буде плідною та зміцнюючою.</p>",
        image: 'https://soulful-images.s3.eu-central-1.amazonaws.com/uploads/4f67fcb5-f40b-4504-bc84-c4c1bab233ad.png',
        published: true,
    },
];

const RECOMMENDATIONS = [
    {
        title: 'Практикуйте медитацію',
        description:
            'Витратьте кілька хвилин кожен день на медитацію, щоб зменшити стрес та покращити концентрацію.',
        published: true,
    },
    {
        title: 'Ведіть щоденник',
        description:
            'Записуйте свої думки та почуття, щоб краще розуміти свої емоції.',
        published: true,
    },
    {
        title: 'Достатньо спіть',
        description:
            "Намагайтесь спати 7-8 годин щоночі для підтримки емоційного та фізичного здоров'я.",
        published: true,
    },
    {
        title: 'Регулярно займайтеся фізичними вправами',
        description:
            'Фізична активність може значно покращити ваш настрій і знизити рівень стресу.',
        published: true,
    },
    {
        title: 'Їжте здорову їжу',
        description:
            'Збалансоване харчування допомагає підтримувати не тільки тіло, але й розум.',
        published: true,
    },
    {
        title: 'Обмежте вживання алкоголю та кави',
        description:
            'Стимулятори та депресанти можуть впливати на ваш настрій і сон.',
        published: true,
    },
    {
        title: "Зв'яжіться з природою",
        description:
            'Час, проведений на свіжому повітрі, може підвищити вашу продуктивність та настрій.',
        published: true,
    },
    {
        title: 'Практикуйте глибоке дихання',
        description:
            'Глибоке дихання допомагає контролювати стрес і заспокоювати розум.',
        published: true,
    },
    {
        title: 'Спілкуйтесь із близькими',
        description:
            "Регулярні розмови з друзями та родиною можуть підтримати ваші соціальні зв'язки.",
        published: true,
    },
    {
        title: 'Встановлюйте цілі',
        description:
            'Маленькі, досяжні цілі можуть підвищити вашу мотивацію та впевненість у собі.',
        published: true,
    },
    {
        title: 'Смійтеся частіше',
        description:
            'Сміх може знизити рівень стресу та підвищити загальне задоволення життям.',
        published: true,
    },
    {
        title: 'Навчайтесь новому',
        description:
            'Інтелектуальні захоплення збагачують розум і зміцнюють психіку.',
        published: true,
    },
    {
        title: 'Практикуйте самоприйняття',
        description:
            'Навчіться приймати себе та свої недоліки як частину своєї унікальності.',
        published: true,
    },
    {
        title: 'Відпочивайте від соцмереж',
        description:
            'Час без гаджетів може зменшити стрес і покращити настрій.',
        published: true,
    },
    {
        title: 'Допомагайте іншим',
        description:
            'Волонтерство або допомога іншим може зробити вас щасливішими та впевненішими у собі.',
        published: true,
    },
    {
        title: 'Слухайте музику',
        description:
            'Музика може підняти настрій або допомогти впоратись із стресом.',
        published: true,
    },
    {
        title: 'Візьміть час для себе',
        description:
            'Самотність може допомогти перезарядити ваші емоційні батареї.',
        published: true,
    },
    {
        title: 'Практикуйте вдячність',
        description:
            'Щоденне вираження вдячності може покращити ваше ставлення до життя та підвищити щастя.',
        published: true,
    },
    {
        title: 'Плануйте свої дні',
        description:
            'Організація допоможе уникнути стресу та підвищити продуктивність.',
        published: true,
    },
    {
        title: 'Відвідуйте культурні заходи',
        description:
            "Театр, музеї, концерти можуть збагатити ваш досвід та покращити емоційне здоров'я.",
        published: true,
    },
    {
        title: 'Спробуйте арт-терапію',
        description:
            'Малювання, ліплення, рукоділля можуть допомогти впоратись із стресом і виразити себе.',
        published: true,
    },
    {
        title: 'Беріть участь у групових заняттях',
        description:
            'Заняття у групі можуть підвищити мотивацію і сприяти новим знайомствам.',
        published: true,
    },
    {
        title: 'Займіться йогою',
        description:
            'Йога поєднує фізичні вправи з духовними практиками, сприяючи гармонії тіла і розуму.',
        published: true,
    },
    {
        title: 'Читайте книги',
        description:
            'Читання може покращити ваші когнітивні функції та забезпечити втечу від реальності.',
        published: true,
    },
    {
        title: 'Обмежте час перед екранами',
        description:
            'Зниження часу, проведеного за екранами, може допомогти поліпшити ваш сон і знизити стрес.',
        published: true,
    },
    {
        title: 'Відвідуйте психотерапію',
        description:
            "Регулярні зустрічі з терапевтом можуть допомогти розібратися у складнощах та покращити психічне здоров'я.",
        published: true,
    },
    {
        title: 'Встановіть межі',
        description:
            'Вчіться говорити "ні" та встановлюйте здорові межі у ваших стосунках.',
        published: true,
    },
    {
        title: 'Заплануйте пригоду',
        description:
            'Мандрівка або новий досвід можуть оновити ваш дух і надихнути на нові ідеї.',
        published: true,
    },
    {
        title: 'Скористайтесь ароматерапією',
        description:
            'Натуральні аромати, такі як лаванда або евкаліпт, можуть заспокоїти ваш розум.',
        published: true,
    },
    {
        title: 'Пробуджуйте раніше',
        description:
            'Ранній підйом може збільшити вашу продуктивність та дати більше часу для ранкових ритуалів.',
        published: true,
    },
    {
        title: 'Спробуйте біорезонансну терапію',
        description:
            'Техніка, що може допомогти управлінні болем та стресом за допомогою електромагнітних хвиль.',
        published: true,
    },
    {
        title: 'Займайтесь гарденінгом',
        description:
            'Догляд за рослинами може бути розслабляючим і зменшувати стрес.',
        published: true,
    },
    {
        title: 'Займайтесь саморозвитком',
        description:
            'Вивчайте матеріали по самовдосконаленню, щоб покращити свої навички і розширити світогляд.',
        published: true,
    },
    {
        title: 'Практикуйте майндфулнес',
        description:
            'Усвідомленість допомагаї підвищити присутність "тут і зараз" та знизити стрес.',
        published: true,
    },
    {
        title: 'Визначте свої цінності',
        description:
            'Живіть у відповідності з вашими цінностями для більшої внутрішньої гармонії.',
        published: true,
    },
    {
        title: 'Розвивайте емпатію',
        description:
            'Вчіться розуміти і співчувати іншим, що може покращити ваши стосунки.',
        published: true,
    },
    {
        title: 'Проходьте курси психологічної грамотності',
        description:
            'Освітні програми допоможуть вам краще розуміти емоції та поведінку.',
        published: true,
    },
    {
        title: 'Розвивайте стратегічне мислення',
        description:
            'Навички планування і рішення складних завдань знижують стрес і покращують управління життєвими ситуаціями.',
        published: true,
    },
    {
        title: 'Навчіться прощати',
        description:
            "Прощення може звільнити вас від ваги минулих образ і покращити психологічне здоров'я.",
        published: true,
    },
    {
        title: 'Використовуйте візуалізацію',
        description:
            'Методи візуалізації допомагають досягти цілей і впоратися із стресом.',
        published: true,
    },
    {
        title: 'Живіть усвідомлено',
        description: 'Сприймайте кожен момент без зайвих очікувань та суджень.',
        published: true,
    },
    {
        title: 'Зберігайте позитивний настрій',
        description:
            "Позитивне мислення може значно покращити ваше психологічне здоров'я.",
        published: true,
    },
    {
        title: 'Покращуйте свої соціальні навички',
        description:
            'Комунікаційні вправи та зустрічі допоможуть вам краще взаємодіяти з іншими.',
        published: true,
    },
    {
        title: 'Дотримуйтесь рутини',
        description:
            'Розробка та дотримання щоденної рутини можуть забезпечити стабільність та зменшити стрес.',
        published: true,
    },
    {
        title: 'Оцінюйте свої досягнення',
        description:
            'Регулярна оцінка досягнень підвищує самооцінку і спонукає до нових успіхів.',
        published: true,
    },
    {
        title: 'Розвивайте свої творчі здібності',
        description:
            'Творчість є чудовим способом вираження себе і зниження стресу.',
        published: true,
    },
    {
        title: 'Піклуйтесь про своє тіло',
        description:
            "Регулярний догляд за своїм тілом покращує самопочуття та підтримує психологічне здоров'я.",
        published: true,
    },
    {
        title: 'Дозвольте собі помилитися',
        description:
            'Приймання невдач як частини навчального процесу може допомогти вам рости та розвиватися.',
        published: true,
    },
    {
        title: 'Розвивайте свою інтуїцію',
        description:
            'Слухаючи свою інтуїцію, ви можете краще розуміти свої інстинкти та емоції.',
        published: true,
    },
    {
        title: 'Практикуйте конструктивне самокритику',
        description:
            "Оцінюйте свої дії об'єктивно, але з доброзичливістю, щоб покращити свої навички та самоповагу.",
        published: true,
    },
];

const caller = createCaller({
    db,
    session: {
        user: {
            permissions: ['*:*:*'],
            id: '',
            name: '',
            email: '',
            image: '',
            busyness: 0,
            roles: [],
            suspended: false,
        },
        expires: 'no 😎',
    },
    entity: 'any',
    action: 'any',
    host: 'localhost',
});

export default async function seed() {
    await Promise.all([
        updatePermissions(),
        createUsers(),
        createPosts(),
        createRecommendations(),
    ]);
}

async function createUsers() {
    const users = await caller.user.list();

    if (users.values.length) {
        perfectlyNormalLog('Users already exist');
        return;
    }

    for (const user of USERS) {
        try {
            const { id } = await caller.user.create(user);
            await db.user.update({
                where: {
                    id,
                },
                data: {
                    roles: {
                        connectOrCreate: {
                            where: {
                                title: 'superadmin',
                            },
                            create: {
                                title: 'superadmin',
                                permissions: {
                                    connect: {
                                        title: '*:*:*',
                                    },
                                },
                            },
                        },
                    },
                },
            });
        } catch (error) {
            perfectlyNormalLog(`Error creating user with ${user.email}`);
        }
    }

    logWithDivider('Users created');
}

async function createPosts() {
    const posts = await caller.post.list();

    if (posts.values.length) {
        perfectlyNormalLog('Posts already exist');
        return;
    }

    console.log('here');
    try {
        await db.post.createMany({ data: POSTS });
    } catch (error) {
        perfectlyNormalLog(`Error creating posts.`);
    }

    logWithDivider('Posts created');
}

async function createRecommendations() {
    const recommendations = await caller.recommendation.list();

    if (recommendations.values.length) {
        perfectlyNormalLog('Recommendations already exist');
        return;
    }

    try {
        await db.recommendation.createMany({ data: RECOMMENDATIONS });
    } catch (error) {
        perfectlyNormalLog(`Error creating recommendations.`);
    }

    logWithDivider('Recommendations created');
}

function perfectlyNormalLog(...args: unknown[]) {
    console.log(...args, 'which is perfectly normal.');
}

await seed();
